Description of the Dataset:
This dataset contains these columns: id, date, price, bedrooms, bathrooms, sqft_living,
sqft_lot, floors, waterfront, view, condition, grade, sqft_above, sqft_basement, yr_built,
yr_renovated, zip code, lat, long, sqft_living15, sqft_lot15.

In [25]:
import pandas as pd
import numpy as np

In [109]:
df = pd.read_csv("housing.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  int64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(4), int64(16), object(1)
memory usage: 3.5+ MB

In [6]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [7]:
df.count()

id               21613
date             21613
price            21613
bedrooms         21613
bathrooms        21613
sqft_living      21613
sqft_lot         21613
floors           21613
waterfront       21613
view             21613
condition        21613
grade            21613
sqft_above       21613
sqft_basement    21613
yr_built         21613
yr_renovated     21613
zipcode          21613
lat              21613
long             21613
sqft_living15    21613
sqft_lot15       21613
dtype: int64

**1. How many houses have a waterfront?
A. 140
B. 340
C. 323
D. 163**

In [16]:
df.groupby("waterfront")["waterfront"].count()

waterfront
0    21450
1      163
Name: waterfront, dtype: int64

**Ans D**

**2. Which zip code has the costliest house?
A. 98456
B. 98102
C. 98283
D. 89034**

In [40]:
grouped = df.groupby("zipcode")["price"].max()
grouped.sort_values(ascending=False).head(1)

zipcode
98102    7700000
Name: price, dtype: int64

**Ans B**

**3. How many houses are having grade 10?
A. 1133
B. 1134
C. 1135
D. 1132**

In [45]:
df.loc[df["grade"] == 10]["id"].count()

1134

**Ans B**

**4. How many null values are there in the dataset?
A. 20
B. 19
C. 0
D. 4**

In [48]:
df.isna().sum()

id               0
date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
grade            0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
zipcode          0
lat              0
long             0
sqft_living15    0
sqft_lot15       0
dtype: int64

**Ans C**

**5. Does this 9126100861 customer have a waterfront?
A. Yes
B. No**

In [51]:
df.loc[df["id"] == 9126100861][["id", "waterfront"]]

             id  waterfront
400  9126100861           0

**Ans B**

**6. How many houses have 3 views?
A. 340
B. 550
C. 510
D. 90**

In [54]:
df.loc[df["view"] == 3]["id"].count()

510

**Ans C**

**7. What is the lowest price of the house?
A. 45000
B. 28000
C. 75000
D. 25000**

In [59]:
df["price"].min()

75000

**Ans C**

**8. Which zip code area has the cheapest house?
A. 98000
B. 98022
C. 80000
D. 94500**

In [63]:
grouped = df.groupby("zipcode")["price"].min()
grouped.sort_values().head(1)

zipcode
98022    75000
Name: price, dtype: int64

**Ans B**

**9. Which area has the biggest sqft_living?
A. 98053
B. 98055
C. 98035
D. None of the above**

In [68]:
grouped = df.groupby("zipcode")["sqft_living"].max()
grouped.sort_values(ascending=False).head(1)

zipcode
98053    13540
Name: sqft_living, dtype: int64

**Ans A**

**10. In which year the costliest house has been built?
A. 2000
B. 1992
C. 1911
D. 1910**

In [69]:
grouped = df.groupby("yr_built")["price"].max()
grouped.sort_values(ascending=False).head(1)

yr_built
1910    7700000
Name: price, dtype: int64

**Ans D**

**11. Which of the following data types can a Pandas Series have?
A. Int
B. Str
C. Float
D. All of the above**

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  int64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(4), int64(16), object(1)
memory usage: 3.5+ MB

**Ans D**

**12. Which of the following is having a one-dimensional array?
A. Series data type
B. DataFrame data type
C. Both of the above
D. None of the above**

**Ans A**

**13. What value will you get on the left side after printing a series format data?
A. Data
B. Value
C. Index
D. All of the above**

In [74]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21608,263000018,20140521T000000,360000,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

**Ans C**

**14. Which of the following is considered as data in pandas?
A. Dictionary
B. Boolean
C. Nd-array
D. All of the above**

**Ans B**

**15. In what format the keys will get converted into when we convert the dictionary data into
data frame format?
A. Rows
B. Columns
C. Indexes
D. Records**

**Ans C**

**16. Write a function to perform the following operation:
Increase the grade of the house by 1 if the sqft of the house is greater than 0 and less than
equal to 400. If the total sqft of the house is greater than 400, increase the grade of the house
by 2.
After creating the above function, which syntax will be using when using apply function to run
the above created function in the dataset?
A. data.apply(your_function_name(arg1))
B. data.apply_fun(function_name())
C. data.app(data)
D. None of the above**

In [78]:
def house_grading(sqft):
    if sqft > 400:
        return 2
    elif sqft > 0 and sqft < 400:
      return 1
    else:
      return 0

df["sqft_lot"].apply(house_grading)

0        2
1        2
2        2
3        2
4        2
        ..
21608    2
21609    2
21610    2
21611    2
21612    2
Name: sqft_lot, Length: 21613, dtype: int64

**Ans D**

**17. How to check the duplicate values on id,grade and location?
A. df.duplicated(subset=['id','zipcode','grade'])
B. df.duplicate(subset=['id','zipcode','grade'])
C. df[df.duplicated(['id','zipcode','grade’])]
D. All of the above**

In [79]:
df.duplicated(subset=['id','zipcode','grade'])

0        False
1        False
2        False
3        False
4        False
         ...
21608    False
21609    False
21610    False
21611    False
21612    False
Length: 21613, dtype: bool

**Ans A**

**18. Which of the following code will help to display the 3rd, 4th and 5th rows from the 6th to 9th
columns of data frame data?
A. data.loc[3:6, 6:10]
B. data.iloc[3;6,6;10]
C. data.iloc[3:6,6:10]
D. None of the above**

In [84]:
df.iloc[3:6, 6:10]

   sqft_lot  floors  waterfront  view
3      5000     1.0           0     0
4      8080     1.0           0     0
5    101930     1.0           0     0

**Ans C**

**19. Which of the following syntax will display the last two records of df?
import pandas as pd
df = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])
A. df.iloc[:'r3']
B. df.loc['r2':'r3']
C. df.iloc['r2':'r3']
D. df.loc[:'r3'**

In [86]:
df = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3']) 
df.loc['r2':'r3']

     A   B
r2  78  67
r3  54  43

**Ans B**

**20. Which of the following is/are true about loc in pandas:
A. Add new rows in the data frames
B. To change the values of a row to a particular value
C. To extract values from the particular rows
D. All of the above**

**Ans C**

**21. Change the date column in the format (dd/mm/year) using the pandas to_datetime()
Function.
A. pd.to_datetime(data['date'], format='%Y-%m-%d', utc=False, dayfirst=True)
B. pd.to_datetime(data['date'])
C. pd.to_datetime(data['dates'], format='%Y-%m-%d', utc=False, dayfirst=True)
D. pd.to_datetime(data['date'])**

**Ans B**

**22. Create a separate data frame that satisfies the conditions below. **

    1. Houses built before 1980
    2. Have more than 2 bedrooms
    3. Have more than 2 floors.

A. data.loc[(data["yr_built"] > 1980) & (data['floors'] > 2) & (data['bedrooms'] > 2)]

B. data.loc[(data["yr_built"] < 1980) & (data['floors'] > 2) & (data['bedrooms'] > 2)]

C. data.loc[(data["yr_built"] | 1980) & (data['floors'] > 2) | (data['bedrooms'] > 2)]

D. data.loc[(data["yr_built"] < 1980) | (data['floors'] > 2) | (data['bedrooms'] < 2)]

**Ans B**

**23. For a given nested list, convert the same into a dataframe.
sample_list = [['Carl', 22],
['Martha', 25],
['Calvin', 12],
['Stuart', 15]
]
The resulting dataframe must contain the column names as ‘Name’, and ‘Age’ with the
respective values from the sample_list.
A. pd.DataFrame(sample_list)
B. pd.DataFrame(sample_list, column_names=['Name', 'Age'])
C. pd.DataFrame(sample_list, columns=['Name', 'Age'])
D. pd.DataFrame(sample_list, column_name=['Name', 'Age'])**

In [88]:
sample_list = [['Carl', 22], ['Martha', 25], ['Calvin', 12], ['Stuart', 15] ] 
sample_list

[['Carl', 22], ['Martha', 25], ['Calvin', 12], ['Stuart', 15]]

In [91]:
df = pd.DataFrame(sample_list, columns=['Name', 'Age'])
df

     Name  Age
0    Carl   22
1  Martha   25
2  Calvin   12
3  Stuart   15

**Ans C**

**24. For a given dictionary, convert the same into a dataframe.**

```python
sample_dict = {'Cristiano': ['Ronaldo','Man U', 801],
'Lionel': ['Messi','PSG', 758],
'Luis': ['Suarez','Atletico Madrid', 509],
'Robert': ['Lewandowski','Bayern Munich', 527],
'Zlatan': ['Ibrahimovic','AC Milan',553]
}
```

A. df1 = pd.Dataframe(sample_dict)
df1 = df1.transpose()
df1.reset_index(inplace = True)
df1.columns = ['First Name','Last Name', 'Club', 'Goals']

B. df1 = pd.DataFrame(sample_dict)
df1 = df1.transpose()
df1.reset_index(inplace = True)
df1.columns = ['First Name','Last Name', 'Club', 'Goals']

C. df1 = pd.DataFrame(sample_dict)
df1.reset_index(inplace = True)
df1.columns = ['First Name','Last Name', 'Club', 'Goals']

D. df1 = pd.DataFrame(sample_dict)
df1 = df1.transpose()
df1.columns = ['First Name','Last Name', 'Club', 'Goals']

In [94]:
sample_dict = {'Cristiano': ['Ronaldo','Man U', 801],
'Lionel': ['Messi','PSG', 758],
'Luis': ['Suarez','Atletico Madrid', 509],
'Robert': ['Lewandowski','Bayern Munich', 527],
'Zlatan': ['Ibrahimovic','AC Milan',553]
}
sample_dict

{'Cristiano': ['Ronaldo', 'Man U', 801],
 'Lionel': ['Messi', 'PSG', 758],
 'Luis': ['Suarez', 'Atletico Madrid', 509],
 'Robert': ['Lewandowski', 'Bayern Munich', 527],
 'Zlatan': ['Ibrahimovic', 'AC Milan', 553]}

In [98]:
df1 = pd.DataFrame(sample_dict)
df1 = df1.transpose()
df1.reset_index(inplace = True)
df1.columns = ['First Name','Last Name', 'Club', 'Goals']
df1

  First Name    Last Name             Club Goals
0  Cristiano      Ronaldo            Man U   801
1     Lionel        Messi              PSG   758
2       Luis       Suarez  Atletico Madrid   509
3     Robert  Lewandowski    Bayern Munich   527
4     Zlatan  Ibrahimovic         AC Milan   553

**Ans B**

**25. For a given tuple, convert the same into a dataframe.**

```
sample_tuple = ([1, 'one', 3],
[2, 'two', 3],
[3, 'Three', 5],
[4, 'Four', 4],
[5, 'Five', 4])
```

A. pd.Dataframe(sample_tuple, columns=['Number', 'Number_text', 'txtlen'])

B. pd.DataFrame(sample_tuple, columns=['Number', 'Number_text', 'txtlen'])

C. pd.dataframe(sample_tuple, columns=['Number', 'Number_text', 'txtlen'])

D. pd.DataFrame(sample_tup, columns=['Number', 'Number_text', 'txtlen'])

In [107]:
sample_tuple = ([1, 'one', 3],
[2, 'two', 3],
[3, 'Three', 5],
[4, 'Four', 4],
[5, 'Five', 4])

df = pd.DataFrame(sample_tuple, columns=['Number', 'Number_text', 'txtlen'])
df

   Number Number_text  txtlen
0       1         one       3
1       2         two       3
2       3       Three       5
3       4        Four       4
4       5        Five       4

**Ans B**

**26. Create a separate dataframe that contains houses ordered in ascending or descending
order of the prices of each house.**

A. ascending = housing.sort_values('price', ascending=False)
descending = housing.sort_values('price', ascending=False)

B. ascending = housing.sort_values('price', ascending=True)
descending = housing.sort_values('price', ascending=False)

C. ascending = housing.sort_values('price', ascending=False)
descending = housing.sort_values('price', ascending=True)

D. ascending = housing.sort_values('price', ascending=True)
descending = housing.sort_values('price', ascending=True)

**Ans B**

**27. Calculate the mean and standard deviation of all the numerical values in the dataset. For
example - the mean for the bedrooms column is 3.370 and the standard deviation is 0.930.**

A. housing.describe()
B. housing.info()
C. housing.corr()
D. housing.std()

In [110]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

**Ans A**

**28. Perform the following operations on the pandas dataframe.**

1. Get the data starting from the rows 25 to 35.
2. Get the price of the houses located at the longitude--122.045 latitude- 47.6168.

A. data[25:35], data.loc[(housing["lat"] == 47.6168) | (data["long"] == -122.045)]

B. data[25:35], data.loc[(housing["lat"] == 48.6168) & (data["long"] == -122.045)]

C. data[25:36], data.loc[(housing["lat"] == 47.6168) & (data["long"] == -122.045)]

D. data[24:36], data.loc[(housing["lat"] == 47.6168) & (data["long"] == -122.045)]

In [112]:
df[25:36], df.loc[(df["lat"] == 47.6168) & (df["long"] == -122.045)]

(            id             date   price  bedrooms  bathrooms  sqft_living  \
 25  1202000200  20141103T000000  233000         3       2.00         1710
 26  1794500383  20140626T000000  937000         3       1.75         2450
 27  3303700376  20141201T000000  667000         3       1.00         1400
 28  5101402488  20140624T000000  438000         3       1.75         1520
 29  1873100390  20150302T000000  719000         4       2.50         2570
 30  8562750320  20141110T000000  580500         3       2.50         2320
 31  2426039314  20141201T000000  280000         2       1.50         1190
 32   461000390  20140624T000000  687500         4       1.75         2330
 33  7589200193  20141110T000000  535000         3       1.00         1090
 34  7955080270  20141203T000000  322500         4       2.75         2060
 35  9547205180  20140613T000000  696000         3       2.50         2300

     sqft_lot  floors  waterfront  view  ...  grade  sqft_above  sqft_basement  \
 25      4697     1.5           0     0  ...      6        1710              0
 26      2691     2.0           0     0  ...      8        1750            700
 27      1581     1.5           0     0  ...      8        1400              0
 28      6380     1.0           0     0  ...      7         790            730
 29      7173     2.0           0     0  ...      8        2570              0
 30      3980     2.0           0     0  ...      8        2320              0
 31      1265     3.0           0     0  ...      7        1190              0
 32      5000     1.5           0     0  ...      7        1510            820
 33      3000     1.5           0     0  ...      8        1090              0
 34      6659     1.0           0     0  ...      7        1280            780
 35      3060     1.5           0     0  ...      8        1510            790

     yr_built  yr_renovated  zipcode      lat     long  sqft_living15  \
 25      1941             0    98002  47.3048 -122.218           1030
 26      1915             0    98119  47.6386 -122.360           1760
 27      1909             0    98112  47.6221 -122.314           1860
 28      1948             0    98115  47.6950 -122.304           1520
 29      2005             0    98052  47.7073 -122.110           2630
 30      2003             0    98027  47.5391 -122.070           2580
 31      2005             0    98133  47.7274 -122.357           1390
 32      1929             0    98117  47.6823 -122.368           1460
 33      1929             0    98117  47.6889 -122.375           1570
 34      1981             0    98058  47.4276 -122.157           2020
 35      1930          2002    98115  47.6827 -122.310           1590

     sqft_lot15
 25        4705
 26        3573
 27        3861
 28        6235
 29        6026
 30        3980
 31        1756
 32        5000
 33        5080
 34        8720
 35        3264

 [11 rows x 21 columns],
            id             date   price  bedrooms  bathrooms  sqft_living  \
 4  1954400510  20150218T000000  510000         3        2.0         1680

    sqft_lot  floors  waterfront  view  ...  grade  sqft_above  sqft_basement  \
 4      8080     1.0           0     0  ...      8        1680              0

    yr_built  yr_renovated  zipcode      lat     long  sqft_living15  \
 4      1987             0    98074  47.6168 -122.045           1800

    sqft_lot15
 4        7503

 [1 rows x 21 columns])

**Ans C**

**29. Create a new column with the floor area(sqft_living, sqft_lot, sqft_above, sqft_basement, all
combined in one column).**`

A. data['Floor Area'] = data['sqft_living'], data['sqft_lot'], data['sqft_basement'],
data['sqft_above']

B. df['Floor Area'] = data['sqft_living'] + data['sqft_lot'] + data['sqft_basement'] +
data['sqft_above']

C. data['Floor Area'] = data['sqft_living', 'sqft_lot','sqft_basement','sqft_above']

D. data['Floor Area'] = data['sqft_liv', 'sqft_lot','sqft_base','sqft_above']

In [113]:
df['Floor Area'] = df['sqft_living'] + df['sqft_lot'] + df['sqft_basement'] + df['sqft_above']

In [114]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,Floor Area
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,1180,0,1955,0,98178,47.5112,-122.257,1340,5650,8010
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639,12382
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,770,0,1933,0,98028,47.7379,-122.233,2720,8062,11540
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,1050,910,1965,0,98136,47.5208,-122.393,1360,5000,8920
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,1680,0,1987,0,98074,47.6168,-122.045,1800,7503,11440
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21608,263000018,20140521T000000,360000,3,2.50,1530,1131,3.0,0,0,...,1530,0,2009,0,98103,47.6993,-122.346,1530,1509,4191
21609,6600060120,20150223T000000,400000,4,2.50,2310,5813,2.0,0,0,...,2310,0,2014,0,98146,47.5107,-122.362,1830,7200,10433
21610,1523300141,20140623T000000,402101,2,0.75,1020,1350,2.0,0,0,...,1020,0,2009,0,98144,47.5944,-122.299,1020,2007,3390
21611,291310100,20150116T000000,400000,3,2.50,1600,2388,2.0,0,0,...,1600,0,2004,0,98027,47.5345,-122.069,1410,1287,5588
21612,1523300157,20141015T000000,325000,2,0.75,1020,1076,2.0,0,0,...,1020,0,2008,0,98144,47.5941,-122.299,1020,1357,3116

**Ans B**

**30. Perform the following operations on the dataframes given below.**

```
A = pd.DataFrame([['Carl', 22],['Martha', 25],['Calvin', 12],['Stuart', 15]], columns=[‘Name’, ‘Age’])
B = pd.DataFrame([['Melvin', 25],['Martha', 34],['Lewis', 32],['Leo', 25]], columns=[‘Name’, ‘Age’])
```

1. Left Outer Join
2. Outer Join
3. Inner Join
4. Right Outer Join

A. inner = pd.merge(A, B, on='Age', how='inner_join')
outer = pd.merge(A, B, on='Age', how='outer_join')
left_outer = pd.merge(A, B, on='Age', how='left_join')
right_outer = pd.merge(A, B, on='Age', how='right_join')

B. inner = pd.merge(A, B, on='Age', how='inner')
outer = pd.merge(A, B, on='Age', how='outer')
left_outer = pd.merge(A, B, on='Age', how='left_outer')
right_outer = pd.merge(A, B, on='Age', how='right_outer')

C. inner = pd.merge(A, B, on='Age', how='inner')
outer = pd.merge(A, B, on='Age', how='outer')
left_outer = pd.merge(A, B, on='Age', how='left')
right_outer = pd.merge(A, B, on='Age', how='right')

D. inner = pd.merge(A, B, on='Age', how='inner')
outer = pd.merge(A, B, on='Age', how='outer')
left_outer = pd.merge(A, B, on='Age', how='outer_left')
right_outer = pd.merge(A, B, on='Age', how='outer_right')

In [117]:
A = pd.DataFrame([['Carl', 22],['Martha', 25],['Calvin', 12],['Stuart', 15]], columns=['Name', 'Age'])
B = pd.DataFrame([['Melvin', 25],['Martha', 34],['Lewis', 32],['Leo', 25]], columns=['Name', 'Age'])

In [118]:
A

     Name  Age
0    Carl   22
1  Martha   25
2  Calvin   12
3  Stuart   15

In [120]:
B

     Name  Age
0  Melvin   25
1  Martha   34
2   Lewis   32
3     Leo   25

In [121]:
inner = pd.merge(A, B, on='Age', how='inner')
inner

   Name_x  Age  Name_y
0  Martha   25  Melvin
1  Martha   25     Leo

In [122]:
outer = pd.merge(A, B, on='Age', how='outer')
outer

   Name_x  Age  Name_y
0    Carl   22     NaN
1  Martha   25  Melvin
2  Martha   25     Leo
3  Calvin   12     NaN
4  Stuart   15     NaN
5     NaN   34  Martha
6     NaN   32   Lewis

In [123]:
right_outer = pd.merge(A, B, on='Age', how='right')
right_outer

   Name_x  Age  Name_y
0  Martha   25  Melvin
1     NaN   34  Martha
2     NaN   32   Lewis
3  Martha   25     Leo

In [124]:
left_outer = pd.merge(A, B, on='Age', how='left') 
left_outer

   Name_x  Age  Name_y
0    Carl   22     NaN
1  Martha   25  Melvin
2  Martha   25     Leo
3  Calvin   12     NaN
4  Stuart   15     NaN

**Ans C**

**31. What will be the correlation between the columns sqft_living and sqft_above?**

A. 0.702035
B. 0.754665
C. 0.876597
D. 0.303093

In [125]:
df["sqft_living"].corr(df["sqft_above"])

0.8765965986813181

**Ans C**

**32. If the correlation between the columns bathrooms and sqft_living is 0.754665, what all
interpretations can be made about the two columns?**

A. A positive correlation between the two columns

B. The columns show perfect correlation.

C. A strong negative correlation between the two columns

D. No correlation between the two columns.

In [127]:
df["sqft_living"].corr(df["bathrooms"])

0.7546652789673733

**Ans A**